<template>
  <div class="main">
    <TheHeader />
    <div class="container">
      <Social />
      <CeramicTiles />
      <DesignerWallpaper />
      <IndividualBlock />
      <div class="cards">
        <div class="card" v-for="card in cards" :key="card.title">
          <Card
            :image="card.image"
            :imagePhone="card.imagePhone"
            :title="card.title"
            :description="card.description"
          />
        </div>
      </div>
      <div class="advantageCards__wrapper">
        <div class="advantageCards__background"></div>
        <div class="advantageCards__title">
          Почему стоит купить дизайнерские обои Респейс?
        </div>
        <div class="advantageCards__titleDividingLine"></div>
        <div class="advantageCards">
          <div
            class="advantageCard"
            v-for="advantageCard in advantageCards"
            :key="advantageCard.title"
          >
            <AdvantageCards
              :image="advantageCard.image"
              :title="advantageCard.title"
              :description="advantageCard.description"
            />
          </div>
        </div>
      </div>
    </div>
    <TheFooter />
  </div>
</template>

<script>
import Card from "@/components/Card.vue";
import IndividualBlock from "@/components/IndividualBlock.vue";
import Social from "@/components/Social.vue";
import CeramicTiles from "@/components/CeramicTiles.vue";
import AdvantageCards from "@/components/AdvantageCards.vue";
import DesignerWallpaper from "@/components/DesignerWallpaper.vue";

export default {
  components: {
    Card,
    IndividualBlock,
    Social,
    CeramicTiles,
    AdvantageCards,
    DesignerWallpaper,
  },

  data() {
    return {
      cards: [
        {
          image: "/cards/card_image_1.png",
          imagePhone: "/cards/card_image_1_phone.png",
          title: "Дизайнерские обои для спальни",
          description:
            '<p>Существует множество способов того, как поклеить обои в спальне. Совсем не обязательно ограничивать себя вариантом, когда одни и те же обои клеятся на все стены.</p><p>Спальня — место вашего отдыха, где ничто не должно вам мешать или беспокоить вас. Чем лучше вы подберете обои для спальни, тем приятней вам будет готовиться ко сну и тем больший заряд бодрости вы будете получать, просыпаясь. Все больше людей, при оформлении спальни, отдают предпочтение обоям на одну, акцентную, стену. Такой подход позволяет, с одной стороны, всегда иметь перед глазами то, что нравится, с другой не перегружает окружающее пространство. Таким образом, вы каждое утро будете видеть то, что вам нравится и получать заряд бодрости.</p><p>Еще один способ — это наклеить несколько полос обоев за кроватью — это позволит вам создать отдельную зону внутри своей спальни и наполнить ее новыми красками.</p><p>Не бойтесь экспериментировать, кроме того, вы всегда можете обратиться к нашим дизайнерам за бесплатным советом. Будем рады вам помочь!</p><p>На фотографии - обои «<a class="link" href="#">Поднебесье</a>»</p>',
        },
        {
          image: "/cards/card_image_2.png",
          imagePhone: "/cards/card_image_2_phone.png",
          title: "Дизайнерские обои для гостиной",
          description:
            '<p>В гостиной хорошо смотрятся обои с необычным рисунком, который создает определенный колорит, зачастую, олицетворяющий характер хозяев. Перед тем, как приступить к выбору дизайнерских обоев, подумайте, какой вы хотите видеть свою гостиную: теплой и уютной или же прохладной и воздушной? Если вам по душе “уютный” вариант, то, скорее всего, вам подойдут обои пастельных, оранжевых или желтых тонов, а если же вам ближе строгий и холодный стиль, то ваш выбор — это обои синего, голубого и серого тона.</p><p>Помните, что в Интернет-магазине обоев Респейс, вы можете бесплатно изменить цвет любых обоев из нашего каталога на тот, который вам больше подходит.</p><p>На фотографии - обои «<a class="link" href="#">Теория струн</a>»</p>',
        },
        {
          image: "/cards/card_image_3.png",
          imagePhone: "/cards/card_image_3_phone.png",
          title: "Дизайнерские обои для кухни",
          description:
            '<p>Обои для кухни должны быть, прежде всего, быть практичными: устойчивыми к механическим повреждениям, воздействию солнечных лучей и, конечно же, моющимися.</p><p>Для того, чтобы дизайнерские обои Респейс радовали вас долгие годы мы рекомендуем заказывать специальное защитное покрытие с ним вы можете не переживать если случайно расплескали кофе или на обои попали жирные брызги, просто протрите обои влажной тряпкой и обои будут как новые.</p><p>Подробнее о защитном покрытии вы можете прочитать <a class="link" href="#">по ссылке</a></p><p>На фотографии - обои «<a class="link" href="#">Фермопилы</a>»</p>',
        },
        {
          image: "/cards/card_image_4.png",
          imagePhone: "/cards/card_image_4_phone.png",
          title: "Дизайнерские обои для детской",
          description:
            '<p>Главное на что нужно обратить внимание при выборе обоев для детской — это экологичность и прочность — качества которые неизменно проверяются при производстве дизайнерских обоев Респейс.</p><p>Кроме того, в нашем Интернет-магазине вы можете купить обои, которые производятся при участии профессиональных психологов и талантливых художников. Такие обои подарят вашим детям много радости и будут способствовать их всестороннему развитию.</p><p>Если вы хотите создать уникальный дизайн детской, мы можем нарисовать обои специально под вас. Стоимость разработки уникального дизайна зависит от сложности и начинается от 2000 рублей.</p><p>На фотографии - обои «<a class="link" href="#">Винни-Пух и Все Все Все</a>»</p>',
        },
        {
          image: "/cards/card_image_5.png",
          imagePhone: "/cards/card_image_5_phone.png",
          title: "Дизайнерские обои для ванны",
          description:
            '<p>Нас часто спрашивают - можно ли наши обои клеить в ванной комнате? Да! Дизайнерские обои Респейс отлично подходят также и для ванных комнат при условии, что не будет прямого воздействия воды. Вы сможете создать уникальный дизайн и быть уверенными, что обои прослужат вам долгие годы.</p><p>На фотографии - обои «<a class="link" href="#">Катори</a>»</p>',
        },
      ],

      advantageCards: [
        {
          image: "/adventage_cards/convience.png",
          title: "Удобство",
          description:
            "В своей жизни видела много обоев, и качество было очень разным. Летом столкнулась с этим магазином, решила делать ремонт в своей спальне. Обои выбрала - полевые цветы. Очень и очень довольна я качеством! Менеджер подобрал именно то, что я хотела, со сроками не затянул. Можно сказать сработали четко. Абсолютна согласна, что обои стоят своих денег",
        },
        {
          image: "/adventage_cards/best_prices.png",
          title: "Лучшие цены",
          description:
            "В своей жизни видела много обоев, и качество было очень разным. Летом столкнулась с этим магазином, решила делать ремонт в своей спальне. Обои выбрала - полевые цветы. Очень и очень довольна я качеством! Менеджер подобрал именно то, что я хотела, со сроками не затянул. Можно сказать сработали четко. Абсолютна согласна, что обои стоят своих денег",
        },
        {
          image: "/adventage_cards/variety.png",
          title: "Разнообразие",
          description:
            "В своей жизни видела много обоев, и качество было очень разным. Летом столкнулась с этим магазином, решила делать ремонт в своей спальне. Обои выбрала - полевые цветы. Очень и очень довольна я качеством! Менеджер подобрал именно то, что я хотела, со сроками не затянул. Можно сказать сработали четко. Абсолютна согласна, что обои стоят своих денег",
        },
        {
          image: "/adventage_cards/individual_approach.png",
          title: "Индивидуальный подход",
          description:
            "В своей жизни видела много обоев, и качество было очень разным. Летом столкнулась с этим магазином, решила делать ремонт в своей спальне. Обои выбрала - полевые цветы. Очень и очень довольна я качеством! Менеджер подобрал именно то, что я хотела, со сроками не затянул. Можно сказать сработали четко. Абсолютна согласна, что обои стоят своих денег",
        },
        {
          image: "/adventage_cards/customer_discounts.png",
          title: "Скидки клиентам",
          description:
            "В своей жизни видела много обоев, и качество было очень разным. Летом столкнулась с этим магазином, решила делать ремонт в своей спальне. Обои выбрала - полевые цветы. Очень и очень довольна я качеством! Менеджер подобрал именно то, что я хотела, со сроками не затянул. Можно сказать сработали четко. Абсолютна согласна, что обои стоят своих денег",
        },
        {
          image: "/adventage_cards/impeccable_quality.png",
          title: "Безупречное качество",
          description:
            "В своей жизни видела много обоев, и качество было очень разным. Летом столкнулась с этим магазином, решила делать ремонт в своей спальне. Обои выбрала - полевые цветы. Очень и очень довольна я качеством! Менеджер подобрал именно то, что я хотела, со сроками не затянул. Можно сказать сработали четко. Абсолютна согласна, что обои стоят своих денег",
        },
        {
          image: "/adventage_cards/security.png",
          title: "Безопасность",
          description:
            "В своей жизни видела много обоев, и качество было очень разным. Летом столкнулась с этим магазином, решила делать ремонт в своей спальне. Обои выбрала - полевые цветы. Очень и очень довольна я качеством! Менеджер подобрал именно то, что я хотела, со сроками не затянул. Можно сказать сработали четко. Абсолютна согласна, что обои стоят своих денег",
        },
        {
          image: "/adventage_cards/uniqueness.png",
          title: "Уникальность",
          description:
            "В своей жизни видела много обоев, и качество было очень разным. Летом столкнулась с этим магазином, решила делать ремонт в своей спальне. Обои выбрала - полевые цветы. Очень и очень довольна я качеством! Менеджер подобрал именно то, что я хотела, со сроками не затянул. Можно сказать сработали четко. Абсолютна согласна, что обои стоят своих денег",
        },
        {
          image: "/adventage_cards/simplicity.png",
          title: "Простота",
          description:
            "В своей жизни видела много обоев, и качество было очень разным. Летом столкнулась с этим магазином, решила делать ремонт в своей спальне. Обои выбрала - полевые цветы. Очень и очень довольна я качеством! Менеджер подобрал именно то, что я хотела, со сроками не затянул. Можно сказать сработали четко. Абсолютна согласна, что обои стоят своих денег",
        },
      ],

      show: false,
    };
  },
};
</script>

<style>
</style>