<template>
  <div class="">
    <TheHeader />
    <div class="cards">
      <div class="card" v-for="card in cards" :key="card.title">
        <Card
          :image="card.image"
          :title="card.title"
          :description="card.description"
        />
      </div>
    </div>
    <TheFooter />
  </div>
</template>

<script>
import Card from "@/components/Card.vue";

export default {
  components: {
    Card,
  },

  data() {
    return {
      cards: [
        {
          image: "/cards/card_image_1.png",
          title: "Дизайнерские обои для спальни",
          description:
            '<p>Существует множество способов того, как поклеить обои в спальне. Совсем не обязательно ограничивать себя вариантом, когда одни и те же обои клеятся на все стены.</p><p>Спальня — место вашего отдыха, где ничто не должно вам мешать или беспокоить вас. Чем лучше вы подберете обои для спальни, тем приятней вам будет готовиться ко сну и тем больший заряд бодрости вы будете получать, просыпаясь. Все больше людей, при оформлении спальни, отдают предпочтение обоям на одну, акцентную, стену. Такой подход позволяет, с одной стороны, всегда иметь перед глазами то, что нравится, с другой не перегружает окружающее пространство. Таким образом, вы каждое утро будете видеть то, что вам нравится и получать заряд бодрости.</p><p>Еще один способ — это наклеить несколько полос обоев за кроватью — это позволит вам создать отдельную зону внутри своей спальни и наполнить ее новыми красками.</p><p>Не бойтесь экспериментировать, кроме того, вы всегда можете обратиться к нашим дизайнерам за бесплатным советом. Будем рады вам помочь!</p><p>На фотографии - обои «<a class="link" href="#">Поднебесье</a>»</p>',
        },
        {
          image: "/cards/card_image_2.png",
          title: "Дизайнерские обои для гостиной",
          description:
            '<p>В гостиной хорошо смотрятся обои с необычным рисунком, который создает определенный колорит, зачастую, олицетворяющий характер хозяев. Перед тем, как приступить к выбору дизайнерских обоев, подумайте, какой вы хотите видеть свою гостиную: теплой и уютной или же прохладной и воздушной? Если вам по душе “уютный” вариант, то, скорее всего, вам подойдут обои пастельных, оранжевых или желтых тонов, а если же вам ближе строгий и холодный стиль, то ваш выбор — это обои синего, голубого и серого тона.</p><p>Помните, что в Интернет-магазине обоев Респейс, вы можете бесплатно изменить цвет любых обоев из нашего каталога на тот, который вам больше подходит.</p><p>На фотографии - обои «<a class="link" href="#">Теория струн</a>»</p>',
        },
        {
          image: "/cards/card_image_3.png",
          title: "Дизайнерские обои для кухни",
          description:
            '<p>Обои для кухни должны быть, прежде всего, быть практичными: устойчивыми к механическим повреждениям, воздействию солнечных лучей и, конечно же, моющимися.</p><p>Для того, чтобы дизайнерские обои Респейс радовали вас долгие годы мы рекомендуем заказывать специальное защитное покрытие с ним вы можете не переживать если случайно расплескали кофе или на обои попали жирные брызги, просто протрите обои влажной тряпкой и обои будут как новые.</p><p>Подробнее о защитном покрытии вы можете прочитать <a class="link" href="#">по ссылке</a></p><p>На фотографии - обои «<a class="link" href="#">Фермопилы</a>»</p>',
        },
        {
          image: "/cards/card_image_4.png",
          title: "Дизайнерские обои для детской",
          description:
            '<p>Главное на что нужно обратить внимание при выборе обоев для детской — это экологичность и прочность — качества которые неизменно проверяются при производстве дизайнерских обоев Респейс.</p><p>Кроме того, в нашем Интернет-магазине вы можете купить обои, которые производятся при участии профессиональных психологов и талантливых художников. Такие обои подарят вашим детям много радости и будут способствовать их всестороннему развитию.</p><p>Если вы хотите создать уникальный дизайн детской, мы можем нарисовать обои специально под вас. Стоимость разработки уникального дизайна зависит от сложности и начинается от 2000 рублей.</p><p>На фотографии - обои «<a class="link" href="#">Винни-Пух и Все Все Все</a>»</p>',
        },
        {
          image: "/cards/card_image_5.png",
          title: "Дизайнерские обои для ванны",
          description:
            '<p>Нас часто спрашивают - можно ли наши обои клеить в ванной комнате? Да! Дизайнерские обои Респейс отлично подходят также и для ванных комнат при условии, что не будет прямого воздействия воды. Вы сможете создать уникальный дизайн и быть уверенными, что обои прослужат вам долгие годы.</p><p>На фотографии - обои «<a class="link" href="#">Катори</a>»</p>',
        },
      ],
    };
  },
};
</script>

<style>
</style>